//•	Какое будет выведено значение: let x = 5; alert( x++ ); ?

// let x = 5; alert( x++ ); //увеличивает на 1 но перед этим возращает 5  если записать ++х то будет 6




// •	Чему равно такое выражение: [ ] + false - null + true ?


// console.log([ ] + false- null + true) //NaN



// •	Что выведет этот код: let y = 1; let x = y = 2; alert(x); ?
// let y = 1;
// let x = y = 2;
// alert(x);  // равно 2




// •	Чему равна сумма [ ] + 1 + 2?

// console.log([ ] + 1 + 2); //12



// •	Что выведет этот код: alert( "1"[0] )?

// alert( "1"[0] );



// •	Чему равно 2 && 1 && null && 0 && undefined ?



// console.log(2 && 1 && null && 0 && undefined);  // и всегда запинается на лжи  или на правде

// •	Есть ли разница между выражениями? !!( a && b ) и (a && b)?
// console.log(!!( 1 && 2 ) === (1 && 2)); // !! превращают в boolean



// •	Что выведет этот код: alert( null || 2 && 3 || 4 ); ?

// alert( null || 2 && 3 || 4 );


// •	a = [1, 2, 3]; b = [1, 2, 3]; Правда ли что a == b ?

// let a = [1, 2, 3];
// let b = [1, 2, 3];
// console.log(a==b);
// не равны т.к разные хранилища информации

// •	Что выведет этот код: alert( +"Infinity" ); ?


// alert( +"Infinity" );

// •	Верно ли сравнение: "Ёжик" > "яблоко"?

// console.log("Ёжик" > "яблоко");



// •	Чему равно 0 || "" || 2 || undefined || true || falsе ?

console.log(0 || "" || 2 || undefined || true || falsе);